package utils;

import java.util.ArrayList;
import java.util.Arrays;

public class Countries {
    private static String[] countriesNames = new String[]{"австралия", "австрия", "азербайджан", "албания", "алжир", "ангилья",
            "ангола", "андорра", "антарктика", "антигуа.барб", "антильские о-ва", "аомынь (макао)", "аргентина",
            "армения", "аруба", "афганистан", "багамские о-ва", "бангладеш", "барбадос", "бахрейн", "белиз",
            "беларусь", "бельгия", "бенин", "бермудские о-ва", "болгария", "боливия", "ботсвана", "бразилия",
            "брит. тер. в инд. ок", "бруней", "буве", "буркина-фасо", "бурунди", "бутан", "вануату", "ватикан",
            "великобритания", "венгрия", "венесуэла", "виргин. о-ва (сша)", "виргин. о-ва (брит.)",
            "вост. самоа. (сша)", "восточный тимор", "вьетнам", "габон", "гаити", "гайана", "гамбия", "гана",
            "гваделупа", "гватемала", "гвиана", "гвинея", "гвинея-бисау", "германия", "гибралтар", "гондурас",
            "гренада", "гренландия", "греция", "грузия", "гуам", "дания", "джибути", "джонстон атолл", "доминика",
            "доминиканск. респ.", "египет", "заир", "замбия", "западная сахара", "западное самоа", "зимбабве",
            "израиль", "индия", "индонезия", "иордания", "ирак", "иран", "ирландия", "исландия", "испания",
            "италия", "йемен", "кабо-верде", "казахстан", "кайман", "камбоджа", "камерун", "канада", "катар",
            "кения", "кипр", "кирибати", "китай", "кокосовые о-ва", "колумбия", "коморские о-ва", "конго",
            "корея (кндр)", "корея респ.", "коста-рика", "кот-д'ивуар", "куба", "кувейт", "кыргызстан", "лаос",
            "латвия", "литва", "лесото", "либерия", "ливан", "ливия", "лихтенштейн", "люксембург", "маврикий",
            "мавритания", "мадагаскар", "малави", "малайзия", "мали", "мал. тихоок. о-ва", "мальдивы", "мальта",
            "марианские о-ва", "марокко", "мартиника", "маршалловы о-ва", "мексика", "микронезия", "мозамбик",
            "молдова", "монако", "монголия", "монтсеррат", "мьянма", "намибия", "науру", "непал", "нигер",
            "нигерия", "нидерланды", "никарагуа", "ниуэ", "новая зеландия", "нов. каледония", "норвегия",
            "норфолк", "объед. араб. эмират", "оман", "о-ва кука", "о-ва мидуэй", "о-в мэн", "о-в рождества",
            "о-в святой елены", "о-в уэйк", "пакистан", "палау", "панама", "папуа-новая гвинея", "парагвай",
            "перу", "питкэрн", "польша", "португалия", "пуэрто-рико", "разделенная зона", "реюньон", "россия",
            "руанда", "румыния", "сальвадор", "сан-марино", "сан-томе и принс.", "саудовская аравия", "свазиленд",
            "сейшельские о-ва", "с.-пьер и микелон", "сенегал", "с. винсент. гренад.", "сент-китс и невис",
            "сент-люсия", "сингапур", "сирия", "словакия", "соломоновы о-ва", "сомали", "судан", "суринам",
            "сьерра-леоне", "США", "сянган (гонконг)", "таджикистан", "таиланд", "тайвань", "танзания",
            "теркс и кайкос", "того", "токелау (юнион)", "тонга", "тринидад и тобаго", "тувалу", "тунис",
            "туркменистан", "турция", "уганда", "узбекистан", "украина", "уоллис и футуна", "уругвай",
            "фарерские о-ва", "фиджи", "филиппины", "финляндия", "фолклендские о-ва", "франция", "фр. полинезия",
            "фр. южные территор.", "херд и макдональд", "центр. афр. республ", "чад", "чешская республика", "чили",
            "швейцария", "швеция", "шпицберген и ян-майе", "шри-ланка", "эквадор", "экватор. гвинея", "эстония",
            "эфиопия", "югославия", "южно-афр. респуб.", "ямайка", "япония"};
    private static String[] countriesCodes = new String[]{"AU", "AT", "AZ", "AL", "DZ", "AI", "AO", "AD", "AQ", "AG", "AN", "MO",
            "AR", "AM", "AW", "AF", "BS", "BD", "BB", "BH", "BZ", "BY", "BE", "BJ", "BM", "BG", "BO", "BW", "BR",
            "IO", "BN", "BV", "BF", "BI", "BT", "VU", "VA", "GB", "HU", "VE", "VI", "VG", "AS", "TP", "VN", "GA",
            "HT", "GY", "GM", "GH", "GP", "GT", "GF", "GN", "GW", "DE", "GI", "HN", "GD", "GL", "GR", "GE", "GU",
            "DK", "DJ", "JT", "DM", "DO", "EG", "ZR", "ZM", "EH", "WS", "ZW", "IL", "IN", "ID", "JO", "IQ", "IR",
            "IE", "IS", "ES", "IT", "YE", "CV", "KZ", "KY", "KH", "CM", "CA", "QA", "KE", "CY", "KI", "CN", "CC",
            "CO", "KM", "CG", "KP", "KR", "CR", "CI", "CU", "KW", "KG", "LA", "LV", "LT", "LS", "LR", "LB", "LY",
            "LI", "LU", "MU", "MR", "MG", "MW", "MY", "ML", "UM", "MV", "MT", "MP", "MA", "MQ", "MH", "MX", "FM",
            "MZ", "MD", "MC", "MN", "MS", "MM", "NA", "NR", "NP", "NE", "NG", "NL", "NI", "NU", "NZ", "NC", "NO",
            "NF", "AE", "OM", "CK", "MI", "IM", "CX", "SH", "WK", "PK", "PW", "PA", "PG", "PY", "PE", "PN", "PL",
            "PT", "PR", "NT", "RE", "RU", "RW", "RO", "SV", "SM", "ST", "SA", "SZ", "SC", "PM", "SN", "VC", "KN",
            "LC", "SG", "SY", "SK", "SB", "SO", "SD", "SR", "SL", "US", "HK", "TJ", "TH", "TW", "TZ", "TC", "TG",
            "TK", "TO", "TT", "TV", "TN", "TM", "TR", "UG", "UZ", "UA", "WF", "UY", "FO", "FJ", "PH", "FI", "FK",
            "FR", "PF", "TF", "HM", "CF", "TD", "CZ", "CL", "CH", "SE", "SJ", "LK", "EC", "GQ", "EE", "ET", "YU",
            "ZA", "JM", "JP"};

    public static ArrayList<String> getItems() {
        ArrayList<String> countries = new ArrayList<>();

        for (int i = 0; i < countriesNames.length; i++) {
            countries.add(countriesNames[i].substring(0, 1).toUpperCase() + countriesNames[i].substring(1) +
                    " (" + countriesCodes[i] + ")");
        }

        return countries;
    }

    private static String getShortName(String line) {
        return line.substring(line.indexOf('(') + 1, line.indexOf('(') + 3);
    }

    public static String getCombinedName(String line) {
        int countryIndex = Arrays.asList(countriesCodes).indexOf(line);

        return countryIndex < 0 ? line : countriesNames[countryIndex].substring(0, 1).toUpperCase() +
                countriesNames[countryIndex].substring(1) +(" (") + line + ")";
    }

    public static String getShortNames(ArrayList<String> list) {
        String result = getShortName(list.get(0));

        for (int i = 1; i < list.size(); i++) {
            result = result.concat(",").concat(getShortName(list.get(i)));
        }
        return result;
    }

    public static ArrayList<String> getCombinedNames(String line) {
        String[] parts = line.split("\\,");
        ArrayList<String> result = new ArrayList<>();

        for (String s : parts) {
            result.add(getCombinedName(s));
        }

        return result;
    }
}
